# Задача 3:
# Дадена е листа со броеви
# list=[14, 21, 28, 32, 37, 49, 85, 92, 100].
# Напиши програма која ќе изброи колку парни, 
# а колку непарни броеви има во неа.

list = [14, 21, 28, 32, 37, 49, 85, 92, 100]
even_count = 0
odd_count = 0
for num in list:
    if num % 2 == 0:
        even_count += 1
    else:
        odd_count += 1

print("Парни броеви:", even_count)
print("Непарни броеви:", odd_count)