# Задача 2:
# Напиши функција која ќе генерира и испечати n први броеви од Фибоначи низата.
# (Првите елементи на Фибоначи се 1, 1, 2, 3, 5, 8, ..., секој нареден се добива 
#  како сума од претходните две броеви).

def Fibonachi(n):
    x, y = 1, 1
    for i in range(n):
        print(x, end=" ")
        x, y = y, y+x
        

num = int(input("Внесете број: "))
Fibonachi(num)