# Задача 8: Побарај од корисникот да внесе неколку 
# броеви (внесот завршува кога ќе внесе -1)
# и пресметај го нивниот просек.
# (Користи while loop)

sum = 0
while True:
    num = int(input("Внесете број (-1 за крај): "))
    if num == -1:
        break
    sum += num

print(f"Просекот на внесените броеви е: {sum / 2}")