# Задача 3:
# students = {
#     “Ana": 8.5,
#     “Marija": 9.2,
#     “Ivan": 7.8
# }
# Додај во новиот речник вредноста Теа со оценка 9.5, смени оценка на Ivan во 8.3.

students = {
    "Ana": 8.5,
    "Marija": 9.2,
    "Ivan": 7.8
}

students["Tea"] = 9.5
students["Ivan"] = 8.3
print (students)